//csv format to json format for  smartAL
//by Kiok Ahn (kiokahn@gazzi.ai, http://gazzi.ai)
//2022-08-25

#pragma once

std::string& rename_label_22(const std::string& label);
std::string& rename_label_30(const std::string& label);

bool csvToJson(
	const std::string& csvFilePath, 
	const std::string& jsonFilePath, 
	const std::string& label_kor, 
	int NoOfPoint, int width, int length);




class CsvToJson
{
public:
	CsvToJson();
	~CsvToJson();

protected:
	Document* m_pdoc;
	Document::AllocatorType& m_allocator;
	Value* m_paryAnnotation;
	Value* m_paryPose;

	std::string JsonDocToString(const Document& doc, bool isPretty = false);
	void create(void);
	void distory(void);

public:
	void AddPose();

};


/*
{
	"annotation": [
		{
			"pose": {
				"location": {
					"¿À¸¥ÂÊ ¹ß ³¡": {
						"x": 1152,
						"y": 597,
						"view": 1
					},
					"¿À¸¥ÂÊ ¹ßµÞ²ÞÄ¡": {
						"x": 1160,
						"y": 588,
						"view": 1
					},
					"¿À¸¥ÂÊ ¹ß": {
						"x": 1172,
						"y": 567,
						"view": 1
					},
					"¿À¸¥ÂÊ ´Ù¸®": {
						"x": 1196,
						"y": 488,
						"view": 1
					},
					"¿À¸¥ÂÊ Çã¹÷Áö": {
						"x": 1225,
						"y": 405,
						"view": 1
					},
					"¿ÞÂÊ ¹ß ³¡": {
						"x": 1307,
						"y": 587,
						"view": 1
					},
					"¿ÞÂÊ ¹ßµÞ²ÞÄ¡": {
						"x": 1304,
						"y": 577,
						"view": 1
					},
					"¿ÞÂÊ ¹ß": {
						"x": 1299,
						"y": 556,
						"view": 1
					},
					"¿ÞÂÊ ´Ù¸®": {
						"x": 1285,
						"y": 493,
						"view": 1
					},
					"¿ÞÂÊ Çã¹÷Áö": {
						"x": 1264,
						"y": 409,
						"view": 1
					},
					"¿À¸¥ÂÊ ¼Õ ³¡": {
						"x": 1096,
						"y": 407,
						"view": 1
					},
					"¿À¸¥ÂÊ ¼Õ": {
						"x": 1106,
						"y": 393,
						"view": 1
					},
					"¿À¸¥ÂÊ ¼Õ¸ñ": {
						"x": 1146,
						"y": 361,
						"view": 1
					},
					"¿À¸¥ÂÊ ÆÈ": {
						"x": 1192,
						"y": 319,
						"view": 1
					},
					"¿À¸¥ÂÊ ¾î±ú": {
						"x": 1223,
						"y": 318,
						"view": 1
					},
					"¿ÞÂÊ ¼Õ ³¡": {
						"x": 1279,
						"y": 424,
						"view": 1
					},
					"¿ÞÂÊ ¼Õ": {
						"x": 1284,
						"y": 408,
						"view": 1
					},
					"¿ÞÂÊ ¼Õ¸ñ": {
						"x": 1294,
						"y": 361,
						"view": 1
					},
					"¿ÞÂÊ ÆÈ": {
						"x": 1274,
						"y": 315,
						"view": 1
					},
					"¿ÞÂÊ ¾î±ú": {
						"x": 1243,
						"y": 317,
						"view": 1
					},
					"¸Ó¸® ³¡": {
						"x": 1213,
						"y": 249,
						"view": 1
					},
					"¸Ó¸®": {
						"x": 1224,
						"y": 290,
						"view": 1
					},
					"¸ñ": {
						"x": 1231,
						"y": 306,
						"view": 1
					},
					"Ã´Ãß4": {
						"x": 1232,
						"y": 309,
						"view": 1
					},
					"Ã´Ãß3": {
						"x": 1237,
						"y": 328,
						"view": 1
					},
					"Ã´Ãß2": {
						"x": 1240,
						"y": 346,
						"view": 1
					},
					"Ã´Ãß1": {
						"x": 1242,
						"y": 363,
						"view": 1
					},
					"Ã´Ãß0": {
						"x": 1244,
						"y": 382,
						"view": 1
					},
					"¾ûµ¢ÀÌ": {
						"x": 1245,
						"y": 399,
						"view": 1
					},
					"ÄÚ": {
						"x": 1199,
						"y": 288,
						"view": 1
					}
				},
				"label": "°­¾ÆÁö",
				"type": "pose"
			}
		},
		{
			"pose": {
				"location": {
					"¿À¸¥ÂÊ ¹ß ³¡": {
						"x": 1084,
						"y": 662,
						"view": 1
					},
					"¿À¸¥ÂÊ ¹ßµÞ²ÞÄ¡": {
						"x": 1099,
						"y": 668,
						"view": 1
					},
					"¿À¸¥ÂÊ ¹ß": {
						"x": 1122,
						"y": 668,
						"view": 1
					},
					"¿À¸¥ÂÊ ´Ù¸®": {
						"x": 1114,
						"y": 580,
						"view": 1
					},
					"¿À¸¥ÂÊ Çã¹÷Áö": {
						"x": 1149,
						"y": 537,
						"view": 1
					},
					"¿ÞÂÊ ¹ß ³¡": {
						"x": 1073,
						"y": 758,
						"view": 1
					},
					"¿ÞÂÊ ¹ßµÞ²ÞÄ¡": {
						"x": 1092,
						"y": 764,
						"view": 1
					},
					"¿ÞÂÊ ¹ß": {
						"x": 1125,
						"y": 761,
						"view": 1
					},
					"¿ÞÂÊ ´Ù¸®": {
						"x": 1096,
						"y": 655,
						"view": 1
					},
					"¿ÞÂÊ Çã¹÷Áö": {
						"x": 1104,
						"y": 542,
						"view": 1
					},
					"¿À¸¥ÂÊ ¼Õ ³¡": {
						"x": 1090,
						"y": 415,
						"view": 1
					},
					"¿À¸¥ÂÊ ¼Õ": {
						"x": 1103,
						"y": 415,
						"view": 1
					},
					"¿À¸¥ÂÊ ¼Õ¸ñ": {
						"x": 1124,
						"y": 407,
						"view": 1
					},
					"¿À¸¥ÂÊ ÆÈ": {
						"x": 1143,
						"y": 392,
						"view": 1
					},
					"¿À¸¥ÂÊ ¾î±ú": {
						"x": 1120,
						"y": 390,
						"view": 1
					},
					"¿ÞÂÊ ¼Õ ³¡": {
						"x": 1086,
						"y": 510,
						"view": 1
					},
					"¿ÞÂÊ ¼Õ": {
						"x": 1073,
						"y": 499,
						"view": 1
					},
					"¿ÞÂÊ ¼Õ¸ñ": {
						"x": 1062,
						"y": 464,
						"view": 1
					},
					"¿ÞÂÊ ÆÈ": {
						"x": 1073,
						"y": 390,
						"view": 1
					},
					"¿ÞÂÊ ¾î±ú": {
						"x": 1099,
						"y": 388,
						"view": 1
					},
					"¸Ó¸® ³¡": {
						"x": 1112,
						"y": 309,
						"view": 1
					},
					"¸Ó¸®": {
						"x": 1109,
						"y": 355,
						"view": 1
					},
					"¸ñ": {
						"x": 1111,
						"y": 376,
						"view": 1
					},
					"Ã´Ãß4": {
						"x": 1121,
						"y": 389,
						"view": 1
					},
					"Ã´Ãß3": {
						"x": 1132,
						"y": 427,
						"view": 1
					},
					"Ã´Ãß2": {
						"x": 1134,
						"y": 457,
						"view": 1
					},
					"Ã´Ãß1": {
						"x": 1134,
						"y": 482,
						"view": 1
					},
					"Ã´Ãß0": {
						"x": 1137,
						"y": 516,
						"view": 1
					},
					"¾ûµ¢ÀÌ": {
						"x": 1130,
						"y": 532,
						"view": 1
					},
					"ÄÚ": {
						"x": 1096,
						"y": 350,
						"view": 1
					}
				},
				"label": "°í¾çÀÌ",
				"type": "pose"
			}
		},
		{
			"pose": {
				"location": {
					"¿À¸¥ÂÊ ¹ß ³¡": {
						"x": 1027,
						"y": 604,
						"view": 1
					},
					"¿À¸¥ÂÊ ¹ßµÞ²ÞÄ¡": {
						"x": 1007,
						"y": 603,
						"view": 1
					},
					"¿À¸¥ÂÊ ¹ß": {
						"x": 976,
						"y": 591,
						"view": 1
					},
					"¿À¸¥ÂÊ ´Ù¸®": {
						"x": 976,
						"y": 502,
						"view": 1
					},
					"¿À¸¥ÂÊ Çã¹÷Áö": {
						"x": 950,
						"y": 415,
						"view": 1
					},
					"¿ÞÂÊ ¹ß ³¡": {
						"x": 959,
						"y": 570,
						"view": 1
					},
					"¿ÞÂÊ ¹ßµÞ²ÞÄ¡": {
						"x": 941,
						"y": 567,
						"view": 1
					},
					"¿ÞÂÊ ¹ß": {
						"x": 913,
						"y": 555,
						"view": 1
					},
					"¿ÞÂÊ ´Ù¸®": {
						"x": 934,
						"y": 480,
						"view": 1
					},
					"¿ÞÂÊ Çã¹÷Áö": {
						"x": 943,
						"y": 400,
						"view": 1
					},
					"¿À¸¥ÂÊ ¼Õ ³¡": {
						"x": 1082,
						"y": 412,
						"view": 1
					},
					"¿À¸¥ÂÊ ¼Õ": {
						"x": 1064,
						"y": 400,
						"view": 1
					},
					"¿À¸¥ÂÊ ¼Õ¸ñ": {
						"x": 1012,
						"y": 371,
						"view": 1
					},
					"¿À¸¥ÂÊ ÆÈ": {
						"x": 985,
						"y": 310,
						"view": 1
					},
					"¿À¸¥ÂÊ ¾î±ú": {
						"x": 983,
						"y": 293,
						"view": 1
					},
					"¿ÞÂÊ ¼Õ ³¡": {
						"x": 948,
						"y": 398,
						"view": 1
					},
					"¿ÞÂÊ ¼Õ": {
						"x": 946,
						"y": 380,
						"view": 1
					},
					"¿ÞÂÊ ¼Õ¸ñ": {
						"x": 943,
						"y": 330,
						"view": 1
					},
					"¿ÞÂÊ ÆÈ": {
						"x": 965,
						"y": 281,
						"view": 1
					},
					"¿ÞÂÊ ¾î±ú": {
						"x": 979,
						"y": 288,
						"view": 1
					},
					"¸Ó¸® ³¡": {
						"x": 1000,
						"y": 229,
						"view": 1
					},
					"¸Ó¸®": {
						"x": 990,
						"y": 265,
						"view": 1
					},
					"¸ñ": {
						"x": 980,
						"y": 281,
						"view": 1
					},
					"Ã´Ãß4": {
						"x": 963,
						"y": 292,
						"view": 1
					},
					"Ã´Ãß3": {
						"x": 948,
						"y": 323,
						"view": 1
					},
					"Ã´Ãß2": {
						"x": 944,
						"y": 344,
						"view": 1
					},
					"Ã´Ãß1": {
						"x": 943,
						"y": 363,
						"view": 1
					},
					"Ã´Ãß0": {
						"x": 935,
						"y": 387,
						"view": 1
					},
					"¾ûµ¢ÀÌ": {
						"x": 943,
						"y": 400,
						"view": 1
					},
					"ÄÚ": {
						"x": 1024,
						"y": 267,
						"view": 1
					}
				},
				"label": "È£¶ûÀÌ",
				"type": "pose"
			}
		}
	]
}
*/